-DATASET GRAPH-STD demo-db/graph-std

--

-CASE DemoDBGraphStdTest

-LOG MatchUserLivesInCity
-STATEMENT MATCH (u:user)-[l:livesin]->(c:city) RETURN u.name, u.age, c.name;
---- 7
Adam|30|Guelph
Adam|30|Guelph
Karissa|40|Waterloo
Noura|25|Kitchener
Noura|25|Waterloo
Noura|25|Waterloo
Zhang|50|Kitchener

-LOG MatchSingleNodeLabel
-STATEMENT MATCH (a:user) RETURN a.name, a.age;
---- 4
Adam|30
Karissa|40
Zhang|50
Noura|25

-LOG MatchCityNodes
-STATEMENT MATCH (c:city) RETURN c.name, c.population;
---- 3
Waterloo|150000
Kitchener|200000
Guelph|75000

-LOG MatchFollowsRel
-STATEMENT MATCH (a:user)-[e:follows]->(b:user) RETURN a.name, b.name, e.since;
---- 8
Adam|Zhang|2022
Karissa|Noura|2020
Karissa|Zhang|2020
Noura|Karissa|2020
Noura|Zhang|2021
Zhang|Adam|2022
Zhang|Karissa|2020
Zhang|Noura|2021